#include <stdio.h>

int main() {
    int a = 5;
    int b = 8;
    int c = a % b;

    // Запитуємо у користувача перше число
    // printf("Введіть число a: ");
    // scanf("%d", &a);

    // // Запитуємо у користувача друге число
    // printf("Введіть число b: ");
    // scanf("%d", &b);

    // // // Обчислюємо кількість чисел у проміжку [a, b]
    //  int n = b - a + 1;

    // // Обчислюємо суму всіх чисел у проміжку [a, b] включно, використовуючи формулу суми арифметичної прогресії
    // int sum = (a + b) * n / 2;

    // Виводимо результат
    // printf("Сума всіх чисел від %d до %d включно: %d\n", a, b, sum);

    return 0;
}
